 # -*- coding: utf-8 -*-
import queue

import requests
import re
import pandas as pd
import time
# 此处写入登录之后自己的cookies
cookie = 'v=0; t=94ec17cf3d17b373fb03407d64d59a92; cookie2=1ed706cdcecf9e5bd2ea0e933c238ecb; _tb_token_=eab1075e47b84; cna=v2EtF3RwdiICAdzCKf6NRDMJ; _samesite_flag_=true; sgcookie=EK3ybcMXiCWOxA%2FbpON7Z; unb=840565103; uc3=id2=W80oVeLwqqHJ&vt3=F8dBxGXEmFD68tq0y%2BI%3D&nk2=AiA3KNRPjQdZ%2Fg%3D%3D&lg2=UtASsssmOIJ0bQ%3D%3D; csg=204dffbd; lgc=a136187101; cookie17=W80oVeLwqqHJ; dnk=a136187101; skt=209646d939adf5b5; existShop=MTU4OTI3MDYxMQ%3D%3D; uc4=id4=0%40We5jfdjHv6I%2BF6g8iZP62TJ2v3k%3D&nk4=0%40AMuESTtqOi8sj6wyHaaXcRUbSl1l; tracknick=a136187101; _cc_=Vq8l%2BKCLiw%3D%3D; _l_g_=Ug%3D%3D; sg=137; _nk_=a136187101; cookie1=AigmTwEtKAFhKPGjn5CHsQDCf9dHq6eC7RkEAD4tzOM%3D; tfstk=cC1PBbTB47Fz15NABQdeRg5suhfRa87l-j86EO_x_tobLcpkbsYIvE4jvE8BXSvl.; mt=ci=0_1; thw=cn; uc1=cookie15=WqG3DMC9VAQiUQ%3D%3D&pas=0&cookie21=Vq8l%2BKCLjhS4UhJVbhgU&cookie16=U%2BGCWk%2F74Mx5tgzv3dWpnhjPaQ%3D%3D&existShop=false&cookie14=UoTUM2LJM0MoUQ%3D%3D; enc=v90hhiepNjEci5xG%2FUn7xmJNcSOBVjc2aNJR3JUer%2Fn7PSEcoey06E1WP5aru0A3ns8rmPCajfUmWZ4pwh%2FYMw%3D%3D; alitrackid=www.taobao.com; lastalitrackid=www.taobao.com; hng=CN%7Czh-CN%7CCNY%7C156; JSESSIONID=87E1982816C26AD341DA16D02EBD0CAA; isg=BKys-nPa3sVcwsr54QphT9IcfYreZVAPeIXXVQbtJNf6EU4bL3APn-rnNdmpmYhn; l=eBSoQO1IQlGT5SdvBO5CFurza77TuIRbzsPzaNbMiInGa1zA9FZd2NQc73QyWdtjgtffLeKzEdARfRevrMzdg2HvCbKrCyCl-xJw-'
# 获取页面信息
def getHTMLText(url):
    headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/76.0.3809.132 Safari/537.36'}
    user_cookies = cookie
    cookies = {}
    for a in user_cookies.split(';'):  # 因为cookies是字典形式，所以用spilt函数将之改为字典形式
        name, value = a.strip().split('=', 1)
        cookies[name] = value
    try:
        r = requests.get(url, cookies=cookies, headers=headers, timeout=60)
        print(r.status_code)
        print(r.cookies)
        return r.text
    except:
        print('获取页面信息失败')
        return ''

#  格式化页面，查找数据
def parsePage(html):
    list = []
    try:
        views_title = re.findall('"raw_title":"(.*?)","pic_url"', html)
        print(len(views_title))  # 打印检索到数据信息的个数，如果此个数与后面的不一致，则数据信息不能加入列表
        print(views_title)
        pic_url = re.findall('"pic_url":"(.*?)","detail_url"', html)
        print(len(pic_url))
        print(pic_url)
        views_price = re.findall('"view_price":"(.*?)","view_fee"', html)
        print(len(views_price))
        print(views_price)
        item_loc = re.findall('"item_loc":"(.*?)","view_sales"', html)
        print(len(item_loc))
        print(item_loc)
        views_sales = re.findall('"view_sales":"(.*?)","comment_count"', html)
        print(len(views_sales))
        print(views_sales)
        comment_count = re.findall('"comment_count":"(.*?)","user_id"', html)
        print(len(comment_count))
        print(comment_count)
        shop_name = re.findall('"nick":"(.*?)","shopcard"', html)
        print(len(shop_name))

        #for i in range(len(views_price)):
        for i in range(12):
            list.append([views_title[i], pic_url[i], views_price[i], item_loc[i], comment_count[i], views_sales[i], shop_name[i]])
        # print(list)
        print('爬取数据成功')
        return list
    except:
        print('有数据信息不全，如某一页面中某一商品缺少地区信息')

# 存储到csv文件中，为接下来的数据分析做准备
def save_to_file(list):
    data = pd.DataFrame(list)
    data.to_csv('./商品数据.csv', header=False, mode='a+')  # 用追加写入的方式

def main():
    ci = pd.read_excel('ci.xlsx',sheet_name='Sheet1',header=None)
    d2 = []
    for i in range(ci.shape[0]):
        d2.append(ci.iloc[i,0])



    # d= [{"data":["连衣裙","半身裙","毛针织衫","T恤","短外套","卫衣","汉服","JK制服","LOLITA","衬衫","百搭裤装","裤裙","牛仔裤","西装","大码女装","时尚套装","蕾丝衫/雪纺衫","风衣","休闲裤","背心吊带","马夹","牛仔外套","阔腿裤","中老年女装","婚纱礼服","民族服装","打底裤","西装裤","唐装","旗袍"],"title":"女装"},{"data":["春夏新品","T恤","衬衫","POLO衫","休闲裤","牛仔裤","套装","外套","夹克","卫衣","风衣","西装","牛仔外套","棒球服","品质好物","皮衣","针织衫/毛衣","运动裤","工装裤","开衫","马甲","毛呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风","专柜大牌","明星网红","原创设计"],"title":"男装"},{"data":["法式内衣","无钢圈内衣","内裤女","文胸","内裤男","长袖睡衣","睡裙","真丝睡衣","丝袜","船袜","情侣睡衣","抹胸","背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","聚拢文胸","男士袜子","棉袜女","卡通睡衣","无痕内裤","少女文胸"],"title":"内衣"},{"data":["流行女鞋","春上新","当季热销","潮流新品","单鞋","靴子","运动风","高跟鞋","红人同款","厚底鞋","内增高","玛丽珍鞋","蝴蝶结鞋","小白鞋","一脚蹬","圆头鞋","方根鞋","水晶鞋","尖头鞋","平底低跟","穆勒鞋","异型跟","新年红","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"],"title":"鞋靴"},{"data":["女包","骚包","双肩包","男包","旅行箱","钱包","真皮包","大牌","宽肩带","小方包","水桶包","迷你包","链条包","贝壳包","波士顿包","手拿包","单肩包","手提包","斜挎包","零钱包","妈妈包","欧美潮搭","日韩流行","青春学院","男士商务","雅痞休闲","拉杆箱","腰包","胸包","手工皮具","红人优品"],"title":"箱包"},{"data":["帽子","贝雷帽","渔夫帽","鸭舌帽","礼帽","草帽","爵士帽","盆帽","八角帽","丝巾","披肩","真丝围巾","棉麻围巾","方巾","手套","真皮手套","触屏手套","半指手套","全指手套","真皮腰带","腰带","手工皮带"],"title":"配件配饰"},{"data":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"],"title":"童装玩具"},{"data":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"],"title":"孕产用品"},{"data":["爱他美","羊奶粉","特殊配方奶粉","喜宝","惠氏","启赋","牛栏","美素佳儿","贝因美","雅培","美赞臣","可瑞康","a2","嘉宝","美林","米粉","泡芙","溶溶豆","肉肠","果肉条","奶片","益生菌","维生素","钙铁锌","DHA","宝宝食用油","核桃油","葡萄糖","宝宝调料","奶瓶","餐具","餐椅","暖奶器","消毒锅","辅食机"],"title":"奶粉辅食"},{"data":["淘宝速达","实体商场服务","淘火炬品牌","生活电器","厨房电器","个人护理","空气净化器","扫地机器人","吸尘器","取暖器","烤箱","豆浆机","榨汁料理","电饭煲","吹风机","足浴盆","剃须刀","卷发器","按摩器材","冬季火锅","蓝牙耳机","电暖桌","蓝牙音箱","电热毯","加湿器","暖风机"],"title":"家电"},{"data":["游戏主机","数码精选","手机壳套","苹果手机壳","surface平板电脑","苹果/Apple iPad Pro","电脑主机","数码相机","电玩动漫","单反相机","华为 MateBook","IPAD mini4","游戏主机","鼠标键盘","无人机","二手数码","二手手机","二手笔记本","二手平板电脑"],"title":"数码"},{"data":["手机","苹果","华为","荣耀","小米","Redmi","vivo","OPPO","三星","iQOO","realme","魅族","二手手机","老人手机","手机配件","一加","诺基亚","努比亚","坚果","索尼","以旧换新","分期免息"],"title":"手机"},{"data":["面膜","洁面","防晒","爽肤水","眼霜","乳液","面霜","精华","卸妆","男士护肤","眼线","粉底液","BB霜","隔离","睫毛膏","彩妆盘","唇膏","腮红","香水","精油","身体护理","丰胸","纤体","脱毛","海外直邮"],"title":"美妆"},{"data":["洗发水","护发素","发膜","头发造型","染发膏","烫发水","假发","沐浴露","私处护理","身体乳液","牙膏","牙刷","漱口水","足浴","足贴","洗手液","卫生巾","成人纸尿裤","抽纸","卷纸","洗衣液","清洁剂","厨房清洁","家私/皮具护理","香薰"],"title":"个人护理"},{"data":["B族维生素","葡萄籽","辅酶Q10","消化酶","软骨素","维生素C","钙","大豆异黄酮","益生菌","鱼油","氨基葡萄糖","葡萄籽","生物素","玛咖（玛卡）","酵素","螺旋藻","胶原蛋白","月见草油","DHA","蔓越莓","左旋肉碱","褪黑素","锯棕榈"],"title":"营养保健"},{"data":["琥珀蜜蜡","翡翠手镯","钻戒","铂金","黄金首饰","高端定制","彩色宝石","珍珠","金镶玉","钻石","K金首饰","岫岩玉雕","和田籽料拍卖","裸石","翡翠玉石","一元起拍","设计师","珠宝首饰","金条","情侣对戒","琥珀原石","老坑冰种拍卖"],"title":"珠宝"},{"data":["眼镜架","3D眼镜","司机镜","防辐射眼镜","老花镜","儿童镜","色盲眼镜","无框眼镜","眼镜片","依视路","雷朋","复古眼镜","超轻眼镜","护目镜","眼镜配件","滑雪镜","超耐磨","GM眼镜","配镜服务"],"title":"眼镜"},{"data":["运动表","卡西欧","国表","时尚表","女表","儿童表","学生表","浪琴","斯沃琪表","镂空机械表","皮带表","钢带表","欧米茄","电子表","陶瓷表","瑞士表","手表放心淘","日韩腕表","情侣表","光能表","怀表","表带","手表配件","休闲","精钢","复古手表","中性手表","帆布表带","深度防水"],"title":"手表"},{"data":["Yeezy 350","Alpha Bounce","AJ30","Stan Smith","大Air皮蓬","KD9","Kayano23","Sock Dart","Hyperdunk","耐克","阿迪达斯","New Balance","亚瑟士","Under Armour","匡威","彪马","VANS","锐步","斯凯奇","美津浓","李宁","跑鞋","篮球鞋","复古休闲","健身","足球","羽毛球"],"title":"运动"},{"data":["鱼线","鱼线轮","户外鞋","登山包","帐篷","睡袋","望远镜","皮肤衣","速干衣","速干裤","手电筒","山地车","公路车","骑行服","护具","军迷用品","舞蹈体操","羽毛球","游泳","瑜伽","跑步机","健身器","烧烤架","休闲鞋","冲锋裤","单车零件","骑行装备","遮阳棚","户外手表","户外风衣","军迷套装","战术鞋"],"title":"户外健身"},{"data":["全新钢琴","二手钢琴","电钢琴","电子琴","萨克斯","尤克里里","架子鼓","小提琴","口琴","手卷钢琴","古筝","古琴","二胡","葫芦丝","陶笛","琵琶","笛子","非洲鼓","贝斯","调音器","节拍器","电吉他","电箱吉他","乐器音箱","电子鼓","手风琴","大提琴","合成器","乐器租赁"],"title":"乐器"},{"data":["DNF","梦幻西游","魔兽","LOL","坦克世界","剑网3","魔域","DOTA2","街头篮球","CF","天龙八部","大话西游2","三国争霸","YY","劲舞团","倩女幽魂","天下3","反恐精英","冒险岛","问道","逆战","大唐无双","征途2","九阴真经","龙之谷","热血江湖","剑灵"],"title":"游戏"},{"data":["手办","盲盒","航海王","命运之夜","高达模型","火影忍者","LOLITA洋装","潮玩","变形金刚","钢铁侠","COSPLAY服装","魔道祖师","BJD娃娃","假面骑士","名侦探柯南","我的英雄学院","哈利波特","秦时明月","剑网三","游戏王","兵人","车模","精灵宝可梦","七龙珠","美国队长","夏目友人帐","布袋戏"],"title":"动漫周边"},{"data":["你的名字","刀剑神域","动物世界","大圣归来","大鱼海棠","毒液","战狼","星球大战","海绵宝宝历险记","深夜食堂","碟中谍","神奇动物","老九门","赛尔号","黑豹","玩具总动员","正义联盟","环太平洋","金刚狼","小猪佩奇","流浪地球"],"title":"热门影视周边"},{"data":["牛奶","柚子茶","酸梅汤","矿泉水","酵素","藕粉","大米","小米","黄豆","火腿","香肠","木耳","枸杞","人参","石斛","雪蛤","蜂蜜","天麻花粉","铁观音","红茶","花草茶","龙井","黑茶","绿茶","鸡尾酒","精酿啤酒","洋酒","红酒"],"title":"美食"},{"data":["荔枝","水果","百香果","芒果","小龙虾","樱桃","榴莲","杨梅","牛排","柠檬","海参","水蜜桃","咸鸭蛋","李子","桃子","龙虾","苹果","黄桃","火龙果","波罗蜜","山竹","蓝莓","鸡胸肉","猕猴桃","三文鱼","红薯","车厘子","海鲜"],"title":"生鲜"},{"data":["冰皮月饼","零食大礼包","牛肉干","面包","辣条","红枣","核桃","饼干","巧克力","葡萄干","芒果干","绿豆糕","薯片","锅巴","海苔","月饼","蛋黄酥","猪肉脯","花生","长沙臭豆腐","瓜子","棒棒糖","糖果","手撕面包","豆干","罗汉果","开心果","山楂","全麦面包","早餐","腰果","压缩饼干"],"title":"零食"},{"data":["鲜花速递","多肉植物","干花","永生花","食虫植物","桌面盆栽","鲜果蓝","仿真植物","仿真蔬果","开业花篮","花瓶","绿植同城","蔬菜种子","水培花卉","苔藓景观","空气凤梨","肥料","花盆花器","花卉药剂","营养土","园艺工具","洒水壶","花架","铺面石","花卉药剂","月季","铁线莲","绣球"],"title":"鲜花园艺"},{"data":["进口狗粮","宠物服饰","狗厕所","宠物窝","航空箱","海藻粉","羊奶粉","宠物笼","狗零食","剃毛器","营养膏","上门服务","猫砂","猫粮","猫爬架","猫砂盆","化毛膏","猫罐头","喂食器","猫抓板","猫玩具","猫笼","水草","水草泥","仿真水草","氧气泵","过滤器","鱼缸","水草灯","鱼粮","水质维护","硝化细菌","除藻剂"],"title":"宠物水族"},{"data":["农药","除草剂","杀虫剂","杀菌剂","肥料","叶面肥","有机肥","新型肥料","氮肥","磷肥","钾肥","种子/种苗","粮油种","蔬菜种","果树苗","食用菌菌种","动物种苗","饲料","预混料","浓缩料","饲料添加剂","全价料","农具","农膜","农机","农配件","畜牧药品/兽药","化学药","中兽药","消毒剂","驱虫药","畜牧设备"],"title":"农资"},{"data":["色卡专拍","T恤汗布","螺纹针织面料","全棉竹节卫衣","棉双纱平纹","棉单面莱卡","弹力莱卡","色丁","cvc牛津纺","75d雪纺汉服面料","仿真丝睡衣面料","服装吊牌定做logo","点点蕾丝网纱","辅料里布","辅料缝衣线","辅料易"],"title":"面料集采"},{"data":["全包","半包","免费设计","全套设计","优质装修公司","样板","小户型","美式风","宜家风","集成吊顶"],"title":"装修"},{"data":["建材优品","智能马桶","客厅灯","LED灯泡","实木地板","强化地板","仿古砖","花砖","马赛克","玻化砖","浴室柜","花洒","浴室柜套装","水槽","台上盆","毛巾杆","普通马桶","龙头","浴缸","墙纸","壁纸","墙布","背景墙","指纹锁","防盗锁","监控摄像头","开关插座","无线摄像头","门","榻榻米","整体橱柜","楼梯","定制淋浴房","定制背景墙","浴霸","凉霸","集成吊顶"],"title":"建材"},{"data":["沙发","床","高低床","餐桌","床垫","茶几","电视柜","衣柜","鞋柜","椅凳","书桌","电脑桌","坐具","现代简约","美式家具","北欧家具","中式家具","儿童家具","真皮沙发","布艺沙发","皮床","实木床","儿童床","乳胶床垫","儿童学习桌","书架","花架","椅子","电脑椅","佛山家具"],"title":"家具"},{"data":["窗帘","地毯","沙发垫","十字绣","桌布","地垫","抱枕","坐垫","飘窗垫","门帘","缝纫机","洗衣机罩","卷帘","珠帘","沙发巾","靠垫","空调罩","餐桌布","门垫","浴室防滑垫","茶几桌布","桌垫","装饰画","摆件","照片墙","相框","墙贴","花瓶","壁纸","挂钟","仿真花","油画","客厅装饰画","玻璃贴纸","香炉","玻璃花瓶","相框挂墙","数字油画","假花","画框","干花","挂画","钟","音乐盒","倒流香炉"],"title":"布艺软饰"},{"data":["夏凉被","草席","床褥","U型枕","蚊帐","凉席","天丝套件","贡缎套件","提花套件","婚庆套件","儿童套件","空调被","儿童床品","麻将凉席","四件套","毛巾被","记忆枕","老粗布","床垫","婚庆床品","床笠","蒙古包蚊帐","空调毯","枕头","宫廷蚊帐","牛皮席","冰丝席","竹席","藤席","床单","四件套","全棉套件","磨毛四件套","保暖套件","婚庆","婚庆套件","儿童套件","儿童床品","贡缎套件","提花套件","被子","蚕丝被","羽绒被","厚被","冬被","七孔被","保暖被","枕头","乳胶枕","羽绒枕","记忆枕","床褥","床单被罩","毛毯","毯子","绒毯"],"title":"床上用品"},{"data":["买车送油卡","v60一口价39.99万","首付一成开新车","超级试驾","新能源车","轿车","SUV","小型车","玛莎拉蒂","沃尔沃","荣威","别克","雪佛兰","日产","本田","起亚","标致","奇瑞","海马","宝马新1系","smart","Mini","荣威","本田","天猫养车","4S保养","上门保养","镀晶服务","打蜡服务","空调清洗"],"title":"品质汽车"},{"data":["司法车拍卖","公车拍卖","二手车卖场","二手车拍卖","汽车估价","车秒拍","大众","宝马","奥迪","丰田","奔驰","本田","别克","福特","马自达","雪佛兰","3万以下","3-5万","5-10万","10-20万","20-30万","30-40万","40万以上","SUV","MPV","跑车","越野车","玛莎拉蒂特价车"],"title":"二手车"},{"data":["车载空气净化器","脚垫","夏季坐垫","后备箱垫","座套","安全座椅","香水","记录仪","手机支架","车载导航","安全预警仪","后视镜导航","机油","燃油宝","轮胎","贴膜","车载吸尘器","镀晶","车蜡","洗车机","轮胎报警器","车充","氙气灯","雨刮","空调滤芯","大灯总成","车挂","安全锤","应急工具","","","","","","","","","","","","","","","","","",""],"title":"汽车用品"},{"data":["打印机","一体机","复合机","3D打印机","投影机","收银机","收银纸","电子面单机","考勤门禁","保险箱","会议白板","安防摄像","无线网卡","WiFi放大器","无线呼叫器","格子间","电脑桌","办公椅","理线器","计算器","荧光告示贴","翻译笔","毛笔","马克笔","文件收纳","本册","书写工具","文具","画具画材","钢笔","中性笔","财会用品","碎纸机","包装设备"],"title":"办公"},{"data":["定制T恤","文化衫","工作服","卫衣定制","LOGO设计","VI设计","海报定制","3D效果图制作","广告扇","水晶奖杯","胸牌工牌","奖杯","徽章","洗照片","照片冲印","相册/照片书","软陶人偶","手绘漫画","纸箱","搬家纸箱","胶带","标签贴纸","二维码贴纸","塑料袋","自封袋","快递袋","气泡膜","编织袋","飞机盒","泡沫箱","气柱袋","纸手提袋","打包绳带","气泡信封","缠绕膜"],"title":"DIY"},{"data":["物联网市场","万用表","电动螺丝刀","管钳子","电钻","无尘锯","电焊机","角磨机","切割机","发电机","快排阀","增压泵","钢珠","测距仪","水平仪","传感器","电容器","变压器","单片机开发板","智能小车","机器人套件","3D打印耗材","GPS","蓝牙","LED灯珠","树莓派"],"title":"五金/电子"},{"data":["保温杯","饭盒","玻璃杯","马克杯","餐具套装","碗","盘","碟","茶具套装","茶杯","茶壶","茶具","陶瓷餐具","拖鞋","雨伞雨具","口罩","垃圾桶","居家鞋","省力拖把","家务清洁","垃圾袋","梳子","抹布","围裙","拖把","浴帘","浴室置物架","拖把桶旋转","镜子","铸铁锅","炒锅","饮具","心机小物","厨房置物架","密封罐","潮州陶瓷","景德镇陶瓷","厨用小工具","刀具砧板","烧烤烘培"],"title":"百货"},{"data":["收纳整理","收纳箱","儿童收纳柜","压缩袋","衣柜整理","鞋柜","布艺软收纳","浴室收纳","置物架","强力不粘钩","厨房收纳","桌面收纳","壁挂收纳","旅行收纳","化妆包","购物车","环保袋","野餐蓝","药箱药盒","衣物洗晒","粘毛剪球","脏衣篮","木制衣架","大型晾晒架","裤架","儿童衣架","柳编","ZAKKA风","原生态","棉麻风","纸质收纳"],"title":"餐厨"},{"data":["创可贴","消毒用品","体温计","冷敷降温","急救箱","医用口罩","绷带纱布","血压监测","血糖监测","心率监测","呼吸制氧","拐杖","轮椅","助行器","矫正牵引","医用床上护理","拔罐"],"title":"家庭保健"},{"data":["英语四级","2018考研","成人学历","小学教学","雅思托福","学历提升","会计提升","ps美工技能","考研辅导","外教口语课","建造师","口语一对一","驾照报名","汽车维修","化妆课程","电商培训","少儿英语","公务员考试","中小学辅导","宝宝早教","健身减肥","DIY手工","微信小程序","JAVA","CAD教程","驾校学车"],"title":"学习"},{"data":["劳动节福利","超市卡","沃尔玛","家乐福","银泰卡","面包券","来伊份券","粽子券","熟食/半成品","星巴克","咖啡","哈根达斯","冰淇淋","网站建设","云服务器","财务管理","网页设计","软件"],"title":"卡券票"},{"data":["婚纱摄影","青岛婚拍","丽江婚拍","三亚婚拍","厦门婚拍","新娘跟妆","婚礼司仪","婚车租赁","婚礼策划","婚宴预订","婚纱礼服","礼服租赁","家电清洗","家庭保洁","搬家搬运","在线洗衣","上门养车","跑腿代办","名企招聘","上门美甲","入职体检","法律咨询","热门兼职","专业翻译"],"title":"本地服务"}]
    name = [['views_title', 'views_price', 'item_loc', 'comment_count', 'views_sales', 'shop_name', 'pic_url']]
    data_name = pd.DataFrame(name)

    data_name.to_csv('./商品数据.csv', header=False, mode='a+')  # 提前保存一行列名称
    #for item in d:
    for item2 in d2:
        print(item2)
        start_url = 'http://s.taobao.com/search?q=' + item2  # 初始搜索地址
        i = 0
        time.sleep(3 + i)
        try:
            page = i + 1
            print('正在爬取第%s页数据' % page)
            url = start_url + 'imgfile=&js=1&stats_click=search_radio_all%3A1&initiative_id=staobaoz_20200408&ie=utf8&sort=sale-desc&bcoffset=0&p4ppushleft=%2C44&s=' + str(44 * i)
            html = getHTMLText(url)
            # print(html)
            list = parsePage(html)
            save_to_file(list)
        except:
            print('数据没保存成功')




    # goods = input('请输入想查询的商品名称：'.strip())  # 输入想搜索的商品名称
    # depth = 1  # 爬取的页数
    # start_url = 'http://s.taobao.com/search?q=' + goods  # 初始搜索地址
    # for i in range(depth):
    #     time.sleep(3 + i)
    #     try:
    #         page = i + 1
    #         print('正在爬取第%s页数据' % page)
    #         url = start_url + 'imgfile=&js=1&stats_click=search_radio_all%3A1&initiative_id=staobaoz_20200408&ie=utf8&sort=sale-desc&bcoffset=0&p4ppushleft=%2C44&s=' + str(44 * i)
    #         html = getHTMLText(url)
    #         # print(html)
    #         list = parsePage(html)
    #         save_to_file(list)
    #     except:
    #         print('数据没保存成功')

if __name__ == '__main__':
    main()
